# 2. 데이터 합치기

In [ ]:
왜 데이터를 합치나요?


추가 속성 값을 추가하는 경우
동일한 컬럼 데이터를 합치는 경우

In [1]:
# PANDAS 패키지 불러오기
import pandas as pd 
import pymysql 
from sqlalchemy import create_engine
 
# DB 커넥션 열기
address = 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl'
engine = create_engine(address) 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
query1 = 'SELECT * FROM KOPO_REGION_MST'
query2 = 'SELECT * FROM KOPO_CHANNEL_SEASONALITY_NEW'

customerData1 = pd.read_sql_query(query1, engine)

customerData2 = pd.read_sql_query(query2, engine)

# 데이터 VIEW
customerData1.head()

customerData2

# 컬럼해더 재정의 FOR문으로 돌린다.
customerData1.columns = [x.upper() for x in customerData1.columns]

customerData2.columns = [x.upper() for x in customerData2.columns]

In [2]:
customerData1.head()

customerData2.head()

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [ ]:
계속 새로운 문제가 생길때마다, 책보고 할 순 없다.
 shift + tab 눌러서 나오는 가이드로 받아서 써야 한다.

### 1. 추가 속성값을 추가하는 경우

In [ ]:
내가 분석하는 데이터에 연관된 다른 속성 정보를 붙이고 싶을 때 
어떻게 해야 할까요?

In [ ]:
데이터 조인 : pd. merge(데이터프레임명1, 데이터프레임명2, left_on=‘데이터프레임1 조인 키’                                                right_on=‘데이터프레임2 조인 키’, how = “left”)

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html

In [ ]:

import numpy as np
# 데이터 조인
pd.merge(selectExample, regionMasterData,\
         left_on='regionid', right_on = 'regionid')\
[['regionid','regionname','product','yearweek','qty']]

# on = [“regionid”,“productgroup”] 등으로도 조인키 추가가능

KOPO_PRODUCT_MST,
KOPO_CHANNEL_SEASONALITY_NEW
regionMasterData, selectExample 변수에 담으세요

In [4]:
regionMasterData = customerData1 
selectExample = customerData2

In [6]:
selectExample.head()

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [7]:
regionMasterData.head()

  REGIONID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질

In [9]:
import numpy as np

In [44]:
# 데이터 조인
mergeData1 = pd.merge(selectExample, regionMasterData,\
         left_on='REGIONID', right_on = 'REGIONID')\
[['REGIONID','REGIONNAME','PRODUCT','YEARWEEK','QTY']]

In [45]:
mergeData1.head()

  REGIONID REGIONNAME    PRODUCT YEARWEEK      QTY
0      A60         태국   PRODUCT4   201402     71.0
1      A60         태국  PRODUCT59   201402  22275.0
2      A60         태국  PRODUCT34   201402   4463.0
3      A60         태국  PRODUCT47   201402      0.0
4      A60         태국  PRODUCT56   201402     23.0

## 교수님 퀴즈

In [32]:
#  selectExample group by 평균 구하고, 
# 기존 데이터에 left join 하고, ratio 컬럼을 추가한다.
# as_index=True 로 하면 다르게 GROUP BY 평균이 구해진다.


groupData = selectExample.\
groupby(['REGIONID','PRODUCT'], as_index=False).\
mean()

groupData.head()

  REGIONID    PRODUCT            QTY
0      A00  PRODUCT34     132.445860
1      A00  PRODUCT58     105.235669
2      A00  PRODUCT59   36086.547771
3      A01   PRODUCT1    5716.726115
4      A01  PRODUCT12  197052.777070

In [ ]:
#mena() 하면 알아서 값 찾는다. yeakweek 는 텍스트라 못찾는듯.
# 아래와 같이 직접 명시도 가능

# groupData = selectExample.\
# groupby(['REGIONID','PRODUCT'], as_index=False)[["qty"]].\ 
# mean()

# groupData.head()

In [34]:
# 데이터 조인

# left join 

mergeData = pd.merge(selectExample, groupData,\
         on=["REGIONID", "PRODUCT"], suffixes=('_a', '_b'), how="left")
mergeData.head()

  REGIONID    PRODUCT YEARWEEK    QTY_a         QTY_b
0      A60   PRODUCT4   201402     71.0     44.662420
1      A60  PRODUCT59   201402  22275.0  35366.050955
2      A60  PRODUCT34   201402   4463.0   6117.560510
3      A60  PRODUCT47   201402      0.0      0.363057
4      A60  PRODUCT56   201402     23.0     18.560510

In [38]:
mergeData["ratio"] = mergeData["QTY_a"] / mergeData["QTY_b"]

In [40]:
mergeData.head()

  REGIONID    PRODUCT YEARWEEK    QTY_a         QTY_b     ratio
0      A60   PRODUCT4   201402     71.0     44.662420  1.589703
1      A60  PRODUCT59   201402  22275.0  35366.050955  0.629841
2      A60  PRODUCT34   201402   4463.0   6117.560510  0.729539
3      A60  PRODUCT47   201402      0.0      0.363057  0.000000
4      A60  PRODUCT56   201402     23.0     18.560510  1.239190

### 2. 동일한 컬럼 데이터를 합치는 경우

In [ ]:
내가 분석하는 데이터에 연관된 다른 속성 정보를 붙이고 싶을 때 
어떻게 해야 할까요?

In [ ]:
데이터 조인 : pd. concat([데이터프레임명1, 데이터프레임명2])

In [ ]:
import numpy as np

# A01 데이터 정제
a01data = selectExample[(selectExample['regionid']=='A01')]
print(len(a01data))

# A71 데이터 정제
a71data = selectExample[(selectExample['regionid']=='A71')]
a71data['qty'] = np.where(a71data['qty'] < 500,500,a71data['qty'])
print(len(a71data))

# 데이터 결과 값 MERGE
mergedata = pd.concat([a01data, a71data], axis=0)
print(len(mergedata))

# 3. 피벗 활용하기

1. PIVOT (행을 열로)

pivot : 데이터프레임명.pivot_table( index = [‘고정key컬럼1’,’고정key컬럼2’],  columns=‘pivot대상컬럼명’, values=‘피벗산대상컬럼’)

In [47]:
selectExample.head()

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [51]:

#  피벗 예시
pivotResult = selectExample.\
pivot_table(index = ['REGIONID','PRODUCT'], columns='YEARWEEK', values='QTY')
pivotResult.reset_index()
pivotResult.columns

pivotResult.head()

YEARWEEK              201401    201402    201403    201404    201405  \
REGIONID PRODUCT
A00      PRODUCT34     661.0     679.0     578.0     532.0     516.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59    9988.0    9005.0    8416.0    8553.0   10355.0
A01      PRODUCT1    14115.0    9169.0   21350.0    9457.0   10254.0
         PRODUCT12  139564.0  109173.0  119281.0  139609.0  167828.0

YEARWEEK              201406    201407    201408    201409    201410  \
REGIONID PRODUCT
A00      PRODUCT34     423.0     407.0     364.0     470.0     538.0
         PRODUCT58       0.0       0.0       0.0       0.0       0.0
         PRODUCT59   13799.0   17292.0   16369.0   15047.0   15895.0
A01      PRODUCT1    10327.0    9581.0   10156.0    9045.0    8141.0
         PRODUCT12  124848.0  157644.0  162431.0  147877.0  145733.0

YEARWEEK              ...       201643    201644    201645    201646  \
REGIONID PRODUCT      ...
A00      PRODUCT34    ...         11.0      15.0      18.0      14.0
         PRODUCT58    ...        155.0     213.0     126.0     101.0
         PRODUCT59    ...      15337.0   19388.0   21567.0   18314.0
A01      PRODUCT1     ...        549.0     452.0     531.0     654.0
         PRODUCT12    ...     158291.0  178978.0  192137.0  441993.0

YEARWEEK               201647    201648    201649    201650    201651  \
REGIONID PRODUCT
A00      PRODUCT34        9.0      17.0      19.0      35.0      73.0
         PRODUCT58      141.0     175.0     155.0     104.0      27.0
         PRODUCT59    19733.0   18127.0   22993.0   26854.0   30237.0
A01      PRODUCT1       962.0     789.0     385.0     287.0     292.0
         PRODUCT12  1663206.0  711806.0  278487.0  320253.0  401602.0

YEARWEEK              201652
REGIONID PRODUCT
A00      PRODUCT34      22.0
         PRODUCT58      19.0
         PRODUCT59   33511.0
A01      PRODUCT1      599.0
         PRODUCT12  208186.0

[5 rows x 157 columns]

2. UNPIVOT (열을 행으로)

unpivot : 데이터프레임명.stack().reset_index(

In [ ]:
unpivotResult=pivotResult.stack().reset_index()
unpivotResult.columns=\
['regionid','product','yearweek','qty']
print(unpivotResult)